---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures
source: html/60532f8b-e10e-c127-8f76-f6376ebf3354.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures

Failures about ColorFill.

## Syntax (C#)
```csharp
public static class ColorFillFailures
```